IdeaRS.OpenModel.Detail.DappedEndHaunchType
Type of haunch on dapped end

IdeaRS.OpenModel.Detail.DappedEndHaunchType.None
No haunch

IdeaRS.OpenModel.Detail.DappedEndHaunchType.Left
Left haunch

IdeaRS.OpenModel.Detail.DappedEndHaunchType.Right
Right haunch

IdeaRS.OpenModel.Detail.DappedEndHaunchType.Both
Both sides